Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs.SaveToLocalFinished
Indicates if the current "save to local" operation has finished.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs.TotalStreams
The total expected number of streams to save to local.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs.FinishedStreams
The number of streams finished since the last time this event was raised.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs.BeforeSaveToCentral
True if the "save to local" operation is occurring before "save to central"; false if after.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs)
Creates a copy of the DocumentSaveToLocalProgessChangedEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToLocalProgessChangedEventArgs
The event arguments used during the save to local phase of the WorksharedOperationProgressChanged event.
Remarks:
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Since:
2017 Subscription Update